<?php

namespace Database\Seeders;

use App\Models\Cash;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Money;

class CreateMoneySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $cashes = [
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2552'
            ],
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2554'
            ],
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2555'
            ],
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2556'
            ],
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2557'
            ],
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2558'
            ],
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2561'
            ],
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2562'
            ],
            [
                'code_money' => '101010',
                'name_money' => 'เงินงบประมาณแผ่นดิน-เงินจัดสรร',
                'budget' => '2563'
            ],


            // เงินจัดสรรงานบริการวิชาการ (หน่วยงาน) รหัส 201030
            [
                'code_money' => '201030',
                'name_money' => 'เงินจัดสรรงานบริการวิชาการ (หน่วยงาน)',
                'budget' => '2552'
            ],
            [
                'code_money' => '201030',
                'name_money' => 'เงินจัดสรรงานบริการวิชาการ (หน่วยงาน)',
                'budget' => '2554'
            ],
            [
                'code_money' => '201030',
                'name_money' => 'เงินจัดสรรงานบริการวิชาการ (หน่วยงาน)',
                'budget' => '2555'
            ],
            [
                'code_money' => '201030',
                'name_money' => 'เงินจัดสรรงานบริการวิชาการ (หน่วยงาน)',
                'budget' => '2560'
            ],
            [
                'code_money' => '201030',
                'name_money' => 'เงินจัดสรรงานบริการวิชาการ (หน่วยงาน)',
                'budget' => '2561'
            ],
            [
                'code_money' => '201030',
                'name_money' => 'เงินจัดสรรงานบริการวิชาการ (หน่วยงาน)',
                'budget' => '2562'
            ],
            [
                'code_money' => '201030',
                'name_money' => 'เงินจัดสรรงานบริการวิชาการ (หน่วยงาน)',
                'budget' => '2563'
            ],



            //เงินบริการวิชาการ (หน่วยงาน) รหัส 203010
            [
                'code_money' => '203010',
                'name_money' => 'เงินบริการวิชาการ (หน่วยงาน)',
                'budget' => '2551'
            ],
            [
                'code_money' => '203010',
                'name_money' => 'เงินบริการวิชาการ (หน่วยงาน)',
                'budget' => '2554'
            ],
            [
                'code_money' => '203010',
                'name_money' => 'เงินบริการวิชาการ (หน่วยงาน)',
                'budget' => '2562'
            ],
            [
                'code_money' => '203010',
                'name_money' => 'เงินบริการวิชาการ (หน่วยงาน)',
                'budget' => '2563'
            ],


            // เงินอื่นๆ (หน่วยงาน) รหัส 203090
            [
                'code_money' => '203090',
                'name_money' => 'เงินอื่นๆ (หน่วยงาน)',
                'budget' => '2552'
            ],
            [
                'code_money' => '203090',
                'name_money' => 'เงินอื่นๆ (หน่วยงาน)',
                'budget' => '2557'
            ],
            [
                'code_money' => '203090',
                'name_money' => 'เงินอื่นๆ (หน่วยงาน)',
                'budget' => '2561'
            ],
            [
                'code_money' => '203090',
                'name_money' => 'เงินอื่นๆ (หน่วยงาน)',
                'budget' => '2562'
            ],

            // เงินเหลือจ่าย (หน่วยงาน) รหัส 206010
            [
                'code_money' => '206010',
                'name_money' => 'เงินเหลือจ่าย (หน่วยงาน)',
                'budget' => '2551'
            ],
            [
                'code_money' => '206010',
                'name_money' => 'เงินเหลือจ่าย (หน่วยงาน)',
                'budget' => '2552'
            ],
            [
                'code_money' => '206010',
                'name_money' => 'เงินเหลือจ่าย (หน่วยงาน)',
                'budget' => '2553'
            ],
            [
                'code_money' => '206010',
                'name_money' => 'เงินเหลือจ่าย (หน่วยงาน)',
                'budget' => '2554'
            ],
            [
                'code_money' => '206010',
                'name_money' => 'เงินเหลือจ่าย (หน่วยงาน)',
                'budget' => '2555'
            ],
            [
                'code_money' => '206010',
                'name_money' => 'เงินเหลือจ่าย (หน่วยงาน)',
                'budget' => '2558'
            ],


            // เงินเหลือจ่าย-เงินบริการวิชาการ (หน่วยงาน) รหัส 206031
            [
                'code_money' => '206031',
                'name_money' => 'เงินเหลือจ่าย - เงินบริการวิชาการ (หน่วยงาน)',
                'budget' => '2559'
            ],
            [
                'code_money' => '206031',
                'name_money' => 'เงินเหลือจ่าย - เงินบริการวิชาการ (หน่วยงาน)',
                'budget' => '2560'
            ],
            [
                'code_money' => '206031',
                'name_money' => 'เงินเหลือจ่าย - เงินบริการวิชาการ (หน่วยงาน)',
                'budget' => '2562'
            ],
            [
                'code_money' => '206031',
                'name_money' => 'เงินเหลือจ่าย - เงินบริการวิชาการ (หน่วยงาน)',
                'budget' => '2563'
            ],

            // เงินจัดสรรโครงการพัฒนาสถาบันฯ รหัส 901010
            [
                'code_money' => '901010',
                'name_money' => 'เงินจัดสรรโครงการพัฒนาสถาบันฯ',
                'budget' => '2556'
            ],

            // เงินเหลือจ่าย - เงินจัดสรรโครงการพัฒนาสถาบันฯ รหัส 906011
            [
                'code_money' => '906011',
                'name_money' => 'เงินเหลือจ่าย - เงินจัดสรรโครงการพัฒนาสถาบันฯ',
                'budget' => '2559'
            ]

        ];

        foreach ($cashes as $key => $value) {
            Cash::create($value);
        }
    }
}